import type { SiteConfig, SiteContent } from "../types";

export const SITE_CONFIG: SiteConfig = {
  title: "Abdelrahman Magdy — Writer Portfolio",
  author: "Abdelrahman Magdy",
  description:
    "كاتب وباحث مصري متخصص في كتابة المحتوى العلمي والفلسفي بأسلوب ترفيهي وقصصي.",
  lang: "ar",
  siteLogo: "/abdelrahman-small.jpg",
  navLinks: [
    { text: "أعمالي", href: "/#projects" },
    { text: "معلومات عني", href: "/#about" },
  ],
  socialLinks: [
    { text: "WhatsApp", href: "https://wa.me/201555911186" },
    { text: "Email", href: "mailto:abdumgdi570@gmail.com" },
  ],
  canonicalURL: "https://astro-zen.vercel.app",
};

export const SITE_CONTENT: SiteContent = {
  hero: {
    name: "عبدالرحمن مجدي",
    specialty: "كاتب وصانع محتوى",
    summary: "كاتب وباحث مصري متخصص في كتابة المحتوى العلمي والفلسفي بأسلوب ترفيهي وقصصي.",
    email: "abdumgdi570@gmail.com",
    whatsapp: "https://wa.me/201555911186",
  },

  projects: [
    {
      name: "الخيال",
      summary: "مقالة تحليلية تستكشف الارتباط الفسيولوجي والفلسفي العميق بين الرؤية المادية والخيال الداخلي. وتطرح قراءة فريدة لمفهوم «البصيرة» من خلال ربط علم النفس التحليلي وعملية دمج الوعي واللاوعي (Shadow Integration) بالرموز الدينية والأسطورية، مثل عين حورس، المسيح الدجال، وتضحية الإله أودين، لتوضيح كيف يشكل خيالنا إدراكنا للحقيقة وتطلعنا للمستقبل.",
      linkPreview: "/article-1",
      image: "/image-1.png",
    },
    {
      name: "هل ستنتهي المعالجات التقليدية؟",
      summary: "رحلة تقنية لتفكيك أسرار عتاد الكمبيوتر، مناقشة أزمة قانون مور، و أسباب استحالة استبدال المعالج بكرت الشاشة، والتحول الثوري المرتقب نحو الأنظمة المتجانسة وشرائح الـ SoC.",
      linkPreview: "/article-2",
      image: "/image-2.jpg",
    },
    {
      name: "سر لفيفة التنين",
      summary: "مقالة فلسفية تستكشف فكرة أن القوة الحقيقية لا تأتي من مصادر خارجية، بل من الهوية والعقلية التي يصنعها الإنسان لنفسه. بالاستناد إلى فيلم Kung Fu Panda، ونظرية المثل لأفلاطون، وأمثلة من التجربة الإنسانية، تناقش المقالة مفهوم 'التقمص' كوسيلة لبناء الذات وتحقيق الأهداف، بأسلوب تأملي يجمع بين السرد والتحليل الفلسفي.",
      linkPreview: "/article-3",
      image: "/image-3.jpg",
    },
    {
      name: "الين واليانج",
      summary: "نص فلسفي يتناول رمزية الين واليانج بوصفها نموذجًا لفهم العلاقة بين الأضداد والإمكانات الكامنة داخلها. يمزج بين الفلسفة الشرقية، وعلم النفس التحليلي، وتأملات في طبيعة الوعي وصناعة المعنى، ليقدم قراءة تحليلية تربط بين المفاهيم المجردة والتجربة الإنسانية.",
      linkPreview: "/article-4",
      image: "/image-4.jpg",
    },
  ],
  about: {
    description: `
      أنا عبدالرحمن مجدي. كاتب وباحث مصري متخصص في كتابة المحتوى العلمي والفلسفي بأسلوب ترفيهي وقصصي. مارست البحث والكتابة كهوايات لسنين. عندي القدرة على تحويل أي موضوع لرحلة شيقة من الاستكشاف مهما كان معقد أو بيحتوي على مفاهيم موجهة للمتخصصين. من خلال قدرة تحليلية نافذة وعقل محب للبحث، اقدر اربط بين الافكار بشكل ممتع وسلس في مختلف المجالات المعرفية، واثير فضول القارئ أو المستمع حتى لو مكنش عنده أي اهتمام مسبق بالموضوع.
    `,
    image: "/abdelrahman-big.jpg",
  },
};

// #5755ff
